//MAPREP JOB 1,MSGCLASS=X,CLASS=A,NOTIFY=&SYSUID                       
//*******************************************************************  
//SRCLIB JCLLIB ORDER=ANGI.PROCLIB                                     
//*******************************************************************  
//ASSEM  EXEC PROC=DFHMAPS,MAPNAME=TEST1M                              
//SYSUT1   DD DSN=ANGI.MAPDEF(TEST01),DISP=SHR                         
//SYSOUT   DD SYSOUT=X                                                 
//SYSLIN   DD DSN=ANGI.LOGMAP(TEST1L),DISP=SHR                         
//*                                                                    